app/Controllers/Absen.php

SELECT *
FROM `siswa`
WHERE `siswa`.`id_siswa` = '0054-furqon'
SELECT *
FROM `absen`
WHERE `id_siswa` = '0054-furqon'
AND `tanggal` = '2025-05-31'
 LIMIT 1
---
    public function absensi()
    {
        $id_siswa = $this->request->getPost('id_siswa');
        $tanggal = date('Y-m-d');

        $siswa = $this->siswaModel->find($id_siswa);
        if (!$siswa) {
            session()->setFlashdata('error', 'Siswa tidak ditemukan.<br>Periksa kembali id user');
            return redirect()->to('/');
        }
        if ($siswa['status'] !== 'active') {
            session()->setFlashdata('error', esc($siswa['nama']) . '<br> tidak dapat melakukan absensi karena sudah selesai prakerin.');
            return redirect()->to('/');
        }

        $absensi = $this->absensiModel->where(['id_siswa' => $id_siswa, 'tanggal' => $tanggal])->first();

SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-05'
AND `keterangan` = 'Hadir'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-05'
AND `keterangan` = 'Izin'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-05'
AND `keterangan` = 'Sakit'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-05'
AND `keterangan` = 'Alpa'
---
    public function dashboard()
    {
        $tanggal = date('Y-m-d');
        $count_hadir = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Hadir')
            ->countAllResults();

        $count_izin = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Izin')
            ->countAllResults();

        $count_sakit = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Sakit')
            ->countAllResults();

        $count_alpa = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Alpa')
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-29'
AND `keterangan` = 'Hadir'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-29'
AND `keterangan` = 'Izin'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-29'
AND `keterangan` = 'Sakit'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-29'
AND `keterangan` = 'Alpa'
SELECT `absen`.`id_siswa`, `siswa`.`nama`, `siswa`.`sekolah`, `absen`.`waktu`, `absen`.`keterangan`
FROM `absen`
JOIN `siswa` ON `siswa`.`id_siswa` = `absen`.`id_siswa`
WHERE `absen`.`tanggal` = '2025-05-29'
---
    public function kehadiran()
    {
        $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');
        $count_hadir = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Hadir')
            ->countAllResults();

        $count_izin = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Izin')
            ->countAllResults();

        $count_sakit = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Sakit')
            ->countAllResults();

        $count_alpa = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Alpa')
            ->countAllResults();

        $kehadiran = $this->absensiModel
            ->select('absen.id_siswa, siswa.nama, siswa.sekolah, absen.waktu , absen.keterangan')
            ->join('siswa', 'siswa.id_siswa = absen.id_siswa')
            ->where('absen.tanggal', $tanggal)
            ->findAll();

SELECT *
FROM `absensi_log`
WHERE DATE(updated_at) = '2025-05-29'
ORDER BY `updated_at` DESC
---
    public function riwayat()
    {
        $tanggal = $this->request->getGet('tanggal'); // filter opsional
        $builder = $this->db->table('absensi_log');

        if ($tanggal) {
            $builder->where('DATE(updated_at)', $tanggal);
        }

        $log = $builder->orderBy('updated_at', 'DESC')->get()->getResultArray();