app/Controllers/Absen.php

UPDATE `absen` SET `waktu_pulang` = '11:01:55'
WHERE `id_absen` = '24'
---
        }
        elseif ($absensi['keterangan'] === 'Hadir' && is_null($absensi['waktu_pulang'])) {
            // Catat waktu pulang
            $this->absensiModel
                ->where('id_absen', $absensi['id_absen'])
                ->set('waktu_pulang', $waktu_sekarang)
                ->update();

SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-06-20'
AND `keterangan` = 'Sakit'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-06-20'
AND `keterangan` = 'Alpa'
SELECT `absen`.`id_siswa`, `siswa`.`nama`, `siswa`.`sekolah`, `absen`.`waktu`, `absen`.`waktu_pulang`
FROM `absen`
JOIN `siswa` ON `siswa`.`id_siswa` = `absen`.`id_siswa`
WHERE `absen`.`tanggal` = '2025-06-20'
AND `absen`.`keterangan` = 'Hadir'
ORDER BY `absen`.`waktu` ASC
---
    public function dashboard()
    {
        $tanggal = date('Y-m-d');

        $count_hadir = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Hadir')
            ->countAllResults();

        $count_izin = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Izin')
            ->countAllResults();

        $count_sakit = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Sakit')
            ->countAllResults();

        $count_alpa = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Alpa')
            ->countAllResults();

        $absensi = $this->absensiModel
            ->select('absen.id_siswa, siswa.nama, siswa.sekolah, absen.waktu, absen.waktu_pulang')
            ->join('siswa', 'siswa.id_siswa = absen.id_siswa')
            ->where('absen.tanggal', $tanggal)
            ->where('absen.keterangan', 'Hadir')
            ->orderBy('absen.waktu', 'ASC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-31'
AND `keterangan` = 'Izin'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-31'
AND `keterangan` = 'Sakit'
SELECT COUNT(*) AS `numrows`
FROM `absen`
WHERE `tanggal` = '2025-05-31'
AND `keterangan` = 'Alpa'
SELECT `absen`.`id_siswa`, `siswa`.`nama`, `siswa`.`sekolah`, `absen`.`waktu`, `absen`.`waktu_pulang`, `absen`.`keterangan`
FROM `absen`
JOIN `siswa` ON `siswa`.`id_siswa` = `absen`.`id_siswa`
WHERE `absen`.`tanggal` = '2025-05-31'
ORDER BY `siswa`.`nama` ASC
---
    public function kehadiran()
    {
        $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');

        $count_hadir = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Hadir')
            ->countAllResults();

        $count_izin = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Izin')
            ->countAllResults();

        $count_sakit = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Sakit')
            ->countAllResults();

        $count_alpa = $this->absensiModel
            ->where('tanggal', $tanggal)
            ->where('keterangan', 'Alpa')
            ->countAllResults();

        $kehadiran = $this->absensiModel
            ->select('absen.id_siswa, siswa.nama, siswa.sekolah, absen.waktu, absen.waktu_pulang, absen.keterangan')
            ->join('siswa', 'siswa.id_siswa = absen.id_siswa')
            ->where('absen.tanggal', $tanggal)
            ->orderBy('siswa.nama', 'ASC')
            ->findAll();