app/Controllers/User.php

    public function index()
    {
        $data['userList'] = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function save()
    {
        $rules = [
            'name' => 'required',
            'username' => 'required|is_unique[users.username]',
            'role' => 'required|in_list[admin,asisten]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', $this->validator->getErrors());
        }

        // $password = password_hash($this->request->getPost('username'), PASSWORD_DEFAULT);

        $data = [
            'name'     => $this->request->getPost('name'),
            'username' => $this->request->getPost('username'),
            'password' => $this->request->getPost('username'),
            'role'     => $this->request->getPost('role')
        ];

        $this->userModel->save($data);
---
INSERT INTO `users` (`name`, `username`, `password`, `role`) VALUES ('albar jmk48', 'albar', '$2y$10$3QfDCCqhjJmmcl9TAvaQH.bN3vsTwhf9nQmnAGc3OenTU526kI.rW', 'asisten')

    public function destroy($id)
    {
        $user = $this->userModel->where('id', $id)->first();
        if (!$user) return redirect()->to('/user')->with('error', 'User tidak ditemukan');

        $this->userModel->delete($user['id']);
---
SELECT *
FROM `users`
WHERE `id` = '6'
 LIMIT 1
DELETE FROM `users`
WHERE `id` IN ('6')

    public function reset($id)
    {
        $user = $this->userModel->where('id', $id)->first();
        if ($user) {
            $hash = $user['username'];
            // dd($hash);
            $this->userModel->update($user['id'], ['password' => $hash]);
---
SELECT *
FROM `users`
WHERE `id` = '4'
 LIMIT 1
UPDATE `users` SET `password` = '$2y$10$ZY/nsJvaa.LYLNGwe2Mj7OQVn6CF87wiBVIWKc6TAvFYRs.IZjC5i'
WHERE `users`.`id` IN ('4')