app/Models/Absen_model.php

SELECT `absen`.`id_siswa`, `siswa`.`nama`, `siswa`.`sekolah`, `absen`.`waktu`
FROM `absen`
JOIN `siswa` ON `siswa`.`id_siswa` = `absen`.`id_siswa`
WHERE `absen`.`tanggal` = '2025-05-05'
AND `absen`.`keterangan` = 'Hadir'
ORDER BY `absen`.`waktu` ASC
---
    public function getAbsensiByDate($tanggal)
    {
        return $this->select('absen.id_siswa, siswa.nama, siswa.sekolah, absen.waktu')
            ->join('siswa', 'siswa.id_siswa = absen.id_siswa')
            ->where('absen.tanggal', $tanggal)
            ->where('absen.keterangan', 'Hadir')
            ->orderBy('absen.waktu', 'ASC')
            ->findAll();

SELECT *
FROM `absen`
WHERE `id_siswa` = '0054-furqon'
ORDER BY `tanggal` DESC
---
    public function getAbsenBySiswa($id_siswa)
    {
        return $this->where('id_siswa', $id_siswa)
            ->orderBy('tanggal', 'DESC')
            ->findAll();