app/Models/Siswa_model.php

SELECT *
FROM `siswa`
SELECT *
FROM `siswa`
WHERE `id_siswa` = '0054-furqon'
---
    public function getSiswa($id = false)
    {
        if ($id === false) {
            $siswaList = $this->findAll();
            foreach ($siswaList as &$siswa) {
                $siswa['attendance_percentage'] = $this->getPersenHadir($siswa['id_siswa']);
                $siswa['total_absensi'] = $this->getTotalAbsensi($siswa['id_siswa']); // Menambahkan total absensi
            }
            return $siswaList;
        } else {
            $siswa = $this->getWhere(['id_siswa' => $id])->getRowArray();

SELECT SUM(CASE WHEN keterangan = "Hadir" THEN 1 ELSE 0 END) as hadir, SUM(CASE WHEN keterangan = "Sakit" THEN 1 ELSE 0 END) as sakit, SUM(CASE WHEN keterangan = "Izin" THEN 1 ELSE 0 END) as izin, SUM(CASE WHEN keterangan = "Alpa" THEN 1 ELSE 0 END) as alpa
FROM `absen`
WHERE `id_siswa` = '0054-furqon'
---
    public function getPersenHadir($id_siswa)
    {
        $builder = $this->db->table('absen');
        $builder->select('SUM(CASE WHEN keterangan = "Hadir" THEN 1 ELSE 0 END) as hadir');
        $builder->select('SUM(CASE WHEN keterangan = "Sakit" THEN 1 ELSE 0 END) as sakit');
        $builder->select('SUM(CASE WHEN keterangan = "Izin" THEN 1 ELSE 0 END) as izin');
        $builder->select('SUM(CASE WHEN keterangan = "Alpa" THEN 1 ELSE 0 END) as alpa');
        $builder->where('id_siswa', $id_siswa);
        $result = $builder->get()->getRow();