app/Models/User_model.php

SELECT *
FROM `users`
WHERE `username` = 'albar'
 LIMIT 1
---
    public function getUser($username)
    {
        return $this->where('username', $username)->first();